/*************************************************************************
                           Unit  -  description
                             -------------------
    début                : 09/06/2022
    e-mail               : matheo.joseph@insa-lyon.fr
*************************************************************************/

//---------- Interface de la classe <Unit> (fichier Unit.h) ----------------
#if ! defined ( Unit_H )
#define Unit_H

//--------------------------------------------------- Interfaces utilisées
//------------------------------------------------------------- Constantes

//------------------------------------------------------------------ Types

//------------------------------------------------------------------------
// Rôle de la classe <Unit>
//
//
//------------------------------------------------------------------------

class Unit 
{
//----------------------------------------------------------------- PUBLIC


public:
    friend class Tile;
//----------------------------------------------------- Méthodes publiques    
    int getTileNumber();
    int getUnitNumber();
//-------------------------------------------- Constructeurs - destructeur
    
    Unit (int tNb, int uNb);
    Unit ();
    

    virtual ~Unit ( );
    // Mode d'emploi :
    //
    // Contrat :
    //

//------------------------------------------------------------------ PRIVE

protected:
//----------------------------------------------------- Méthodes protégées

//----------------------------------------------------- Attributs protégés
    int tileNumber;
    int unitNumber; 

};

//-------------------------------- Autres définitions dépendantes de <Unit>

#endif // Unit_H

